test/tests/mesh/cube_slice/test_3/foaminput/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Wall-0
    {
        type            noSlip;
    }
    Wall-1
    {
        type            noSlip;
    }
    Wall-2
    {
        type            noSlip;
    }
    Wall-3
    {
        type            noSlip;
    }
    Wall-4
    {
        type            noSlip;
    }
    Wall-5
    {
        type            noSlip;
    }
}


// ************************************************************************* //
